#include <iostream>
#include <string>
using namespace std;
int main(void){
    int n;
    int i;
    bool first=true;
    string t[15]={"2(0)","2","2(2)","2(2+2(0))","2(2(2))","2(2(2)+2(0))","2(2(2)+2)",
    "2(2(2)+2+2(0))","2(2(2+2(0)))","2(2(2+2(0))+2(0))","2(2(2+2(0))+2)",
    "2(2(2+2(0))+2+2(0))","2(2(2+2(0))+2(2))","2(2(2+2(0))+2(2)+2(0))",
    "2(2(2+2(0))+2(2)+2)"};
    cin >> n;
    for (i=15;i>=0;i--){ 
        if ((n>>i)&1){ //意思是“如果n的二进制形式从右往左数第i位是1”，不理解的同学请补习位运算
            cout << (first? (first=false,"") :"+"); //如果不是第一项，就输出"+"号
            cout << t[i];
        }
    }
    return 0;
}
